## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.synapse_workspace.azurerm_role_assignment.synapse_storage_contrib will be created
  + resource "azurerm_role_assignment" "synapse_storage_contrib" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "5588643e-dad9-467f-933e-0e5a83e24425"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/52c2f634-4765-4411-92ac-08cdb532a0d1/resourceGroups/Synapse-demo/providers/Microsoft.Storage/storageAccounts/synapsetest1298tf"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```
</details>